nc: 10  # number of classes

# Optional for scaled models
scales:
  n: [0.33, 0.25, 256]
  s: [0.50, 0.50, 512]
  m: [0.75, 0.75, 768]
  l: [1.00, 1.00, 1024]

# Activation function
activation: "nn.SiLU()"  # or nn.LeakyReLU(0.1), etc.

# Backbone definition
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [32, 3, 2]]        # 0 - P1/2
  - [-1, 1, Conv, [64, 3, 2]]        # 1 - P2/4
  - [-1, 1, C3, [64]]                # 2
  - [-1, 1, Conv, [128, 3, 2]]       # 3 - P3/8
  - [-1, 2, C3, [128]]               # 4
  - [-1, 1, Conv, [256, 3, 2]]       # 5 - P4/16
  - [-1, 2, C3, [256]]               # 6
  - [-1, 1, Conv, [512, 3, 2]]       # 7 - P5/32
  - [-1, 1, SPPF, [512, 5]]          # 8

# Head definition
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 1, C3, [256]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 1, C3, [128]]

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 1, C3, [256]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 8], 1, Concat, [1]]
  - [-1, 1, C3, [512]]

  - [[5, 11, 13], 1, Detect, [nc]]
